from rubpy import Message,Client,handlers,models,methods
from asyncio import  run, sleep 
import random 
from datetime import datetime 
print("**********Welcome to the robot**********")
print("**********The robot is active**********")
my_group ="g0DYTT805d6479b06dbb98445eca94d9"
my_filters = ("@", "join", "rubika.ir")
group_admins = []
silence_list = []
no_gifs = False
warning_users = []
warns_del = 3
channe_id = "..."
my_insults = (
    "کیر",
    "کص",
    "کون",
    "کس ننت",
    "کوس",
    "کوص",
    "ممه",
    "ننت",
    "بی ناموس",
    "بیناموس",
    "بیناموص",
    "بی ناموص",
    "گایید",
    "جنده",
    "جندع",
    "جیندا",
    "پستون",
    "کسکش",
    "ننه کس",
    "اوبی",
    "هرزه",
    "قحبه",
    "عنتر",
    "فاک",
    "کسعمت",
    "کصخل",
    "کسخل",
    "تخمی",
    "سکس",
    "صکص",
    "کسخول",
    "کسشر",
    "کسشعر",
    "کص",
    "کص ننت",
    "کصخارت",
    "کص خارت",
    "کص خواهرت",
    "پلشت",
    "بکیرم",
    "کونی",
    "کیونی",
    "حرومزاده",
    "کص خارت",
    "بچه کونی",
)

texts_jok = [
 " الیسا و ملیسا، رفتن برن کلیسا تو راهروی کلیسا، گیر کرد به سقف کلیپسا",
 "ولی دختر بودنم سخته ها فک کن عکس خودت به اون خوشگلیو بدی عکس یه پسرو بگیری",
"نوک مداد قرمزای سوسمارنشان رو که زبون می زدی خوش رنگ تر می شد",
"طرف بعد امتحان همچین میاد بیرون سیگار می کشه که انگار شرکتش ورشکست شده",
"زن: مرد چرا کولر نمی خری ؟ به درد نمی خوره اونایی هم که دارن گذاشتن رو پشت بوم",
"یه سیب زمینی شوهرش میمیره بند نمیندازه میشه کیوی",
"چوپان دروغگو میمیره توی قبر ازش میپرسن اسمت چیه میگه دهقان فداکار",
"غضنفر می ره عروسی ‌‌‌؛ تو عروسی برف شادی می زنن ؛ سرما می خوره!!",
"غضنفر با کلید گوشش رو تمیز می کرده؛ گردنش قفل می کنه!!",
"به غضنفر می گن: شنیدم آدم شدی؟ می گه: نامردا شایعه کردن!!",
"تو امتحان دنبال این نیستن که چقد حالیته دنبال اینن که چی بلند نیستی",
"اگه تو مدرسه یه درس برامون می ذاشتن با عنوان آموزش تقلب هیچ وقت تقلب یاد نمی گرفتیم",
"بعضیا تیپ شون یه جوریه که آدم نمی دونه دارن مسخره بازی درمیارن یا واقعا مد روزه!",
"اونی که داداش نداره مثل کسیه که بدون سلاح به جنگ میره",
"یعنی درک و شعوری که استامینوفن واسه تسکین درد آدم داره؛ بعضی از آدما ندارن",
"دوست داشتن کسی که دوستت نداره مثل اینه که توی فرودگاه منتظر کشتی باشی!",
"من چاق نیستم، فقط استخوان بندی شکمم درشته",
"غضنفر میمیره، عکسشو نداشتند بذارن رو قبرش، تا گردن دفنش می‌کنند",
"چنتا پست شکست عشقی دارم رو دستم باد کرده. یکی بیاد با من ازدواج کنه بعد ولم کنه تا من اینارو بذارم",
"بعدها به بچه هام می گم شما یادتون نمیاد… یه زمانی خوشگلی خدادادی بود",
"قدر کسی یا چیزی که دارین رو بدونین، قبل از اینکه بقیه قدرشونو بدونن",
"پدر: پسرم هروقت من رو اذیت می کنی یکی از موهای سرم سفید می شه. پسر: پس برای همین بابا بزرگ تمام موهاش سفید شده؟!",
"اطلاعات من در مورد بازار بورس در این حده که سبزا بهتر از قرمزان -__",
"هم عاشقتم هم ازت متنفرم، میانگین که بگیری می‌بینی برام مهم نیستی",
"دادم هارد لپ تاپمو ریکاوری کردن‌ الان یه هفتس زنگ می‌زنن می‌گن بیا ببرش، اما روم نمیشه برم…",
"شمام مامانتون از در میاد توو، هنو منتظرید از توو کیفش بهتون خوراکی بده ؟ یا من برم یه 10 سال بزرگتر شم بعد بیام",
"پاييز واسه همه خاطرات عاشقانه است واسه ما معموليا همينكه مگس و پشه ها كم ميشن جای خوشحالی داره !",
"سوار ماشین شدم راننده از دست مسافر قبلی شاکی بود گفت: لعنت به این شغل که ما باید هر الاغ بیشعوری رو سوار کنیم",
"ﺩﻗﺖ ﮐﺮﺩﯾﻦ ﺍُﺩﮐﻠﻦ 200 ﻫﺰﺍﺭ ﺗﻮﻣﻨﯽ ﻣﯿﺰﻧﯽ 3 ﺳﺎﻋﺘﻢ ﺑﻮﺵ ﻧﻤﯿﻤﻮﻧﻪ ! ﺑﻌﺪ ﯾﻪ ﺳﯿﮕﺎﺭ 200 ﺗﻮﻣﻨﯽ ﻣﯿﮑﺸﯽ ﺗﺎ 3 ﺭﻭﺯ ﺑﻮﺵ ﻣﯿﻤﻮﻧﻪ !",
"بابام به مامانم اس ام اس عاشقانه فرستاده، الان 2 روزه خونمون دعواست، مامانم گیر داده به بابام که این اس ام اس و کی واست فرستاده بوود",
"سالها گذشت و ما نفهمیدیم وقتی تو دستشویی هستیم کسی در میزنه باید چی جوابش بدیم؛ اینجایم، اینجا پره، من تو هستم, کار دارم، هنوز تموم نشده",
"پدر: پسرم هروقت من رو اذیت می کنی یکی از موهای سرم سفید می شه. پسر: پس برای همین بابا بزرگ تمام موهاش سفید شده؟!",
"احمقانه ترین حرکت ضد بشری اینه که می آیید گل پسر معتادتون رو دوماد می کنید که سر براه شه",
"یه چند وقتیه کودک درونم ناآرومه، مدام بهانه می گیره و … به نظرتون اگه بزنم لهش کنم، کودک آزاری محسوب می شه",
" تا پونزده سالگیم فکر می کردم اسمم زُهره است، چون همیشه مامانم وقتی می خواست بیدارم کنه می گفت: پاشو ظهره!",
" اگه زشتیم، حداقلش فتوشاپی نیستیم.",
"با بابام حرفم شد رفت تو آشپزخونه و به مامانم گفت: واسه خاطر چهل تومن یارانه باید این الدنگ رو تحمل کنیم!",
"پشتِ سر هر انسان موفق یه عالمه حرف هست.  مثل: پدر سگِ دزد!",
" عدالت یعنی چی؟  عدالت یعنی اینکه یکی هفت میلیارد پول از باباش ارث می بره و یکی کچلی",
"به سرم زده قید همه چیزو بزنم برم آمریکا پیش بابام. فقط حیف بابام اونجا نیست.",
"قربون مادری که اگه ۱۰۰ تا پریز خالی هم باشه  برا وصل کردن اتو گوشیِ تو رو از شارژ در می آره",
"منطق ایرانی دوحالت داره: یا حق با منه، یا تو نمی فهمی که حق با منه!",
"اینایی که میگن لایک کن تا لایک شی!! همونایی هستن که تو بچگی موی همو میکشیدن بعد میگفتن ول کن تا ول کنم!",
"یه عبارتی وجود داره به اسم «نه، کلا میگم» قشنگ میتونی حرفتو بزنی و ماله بکشی روش",
"بابام خطاب به من اگه این پول هایی رو که خرج تو و دانشگات کردم الان جمع میکردم میلیاردر بودم و میتونستم یه پسر دانشمند هم سن و سال تو بخرم.",
"من یه صندوق صدقه تو اتاقم دارم هر روز یه مبلغی میندازم توش تا آخر ماه یکجا که شد برمیدارم میزارم تو جیبم! اینطوری هم هفتاد نوع بلا رو دفع کردم ؛ هم به یه بدبخت کمک کردم",
"یه چیزی که مدت‌ها نگهش داشتی و دیگه به دردت نمیخوره رو بندازش دور. حالا اگه یک ساعت بعدش همون جنس به کارت نیومد بیا بزن تو گوش من!",
"دادم هارد لپ تاپمو ریکاوری کردن‌ الان یه هفتس زنگ می‌زنن می‌گن بیا ببرش، اما روم نمیشه برم",
"هیچ لذتی اندازه‌ی این که یه بچه‌ی کوچولو دستشو دراز کنه طرفت که یعنی بغلم کنی نیس و حال نمیده!!! اصن یه لذت عجیبی داره!!!",
]

texts_chat5 = [
"شرکت کوکا کولا روزانه بیش از 1 میلیارد از محصولات خود را به فروش می رساند",
"اسب های دریایی تنها حیواناتی هستند که در آن ها جنس نر باردار می شود.",
"روش استفاده ی صحیح از سنجاق سر به این صورت است که قسمت شیاردار را برای نگه داشتن موها استفاده می کنند، با این روش دیگر سنجاق سر در موهای شما گیر نمی کند",
"کلاه ایمنی فضانوردان دستگاه های خاصی برای خاراندن بینی دارد",
"یونانیان باستان معتقد بودند که زندگی یک فرد در کبد متمرکز است و نه در قلب.",
"آتش هیچ سایه ای ندارد زیرا آتش خودش منبع نور است و هنگامی که پرتو نور تولید شده از آتش مسدود می شود، سایه ها ظاهر می شوند",
"قلب میگو در سرش قرار گرفته است",
"تمساح نمی تواند زبانش را از دهانش بیرون بیاورد.",
"موش ها و اسب ها هرگز نمی توانند استفراغ کنند",
"لئوناردو داوینچی قیچی را اختراع کرده است.",
"چشم های شتر مرغ بزرگتر از مغز اوست",
"ستاره دریایی مغز ندارد",
"خرس های قطبی چپ دست هستند.",
"اگر بخواهید از کره شمالی به فنلاند بروید فقط باید از یک کشور عبور کنید؛ کشور روسیه"
"قطب جنوب بزرگترین بیابان کره ی زمین است",
" پنج گونه مار در سراسر جهان وجود دارد که می توانند پرواز کنند",
" اثر زبان شما مانند اثر انگشتان شما منحصر به فرد است.",
"با یک مداد می توانید خطی به طول 61 کیلومتر بکشید.",
"حلزون های بی صدف 4 بینی دارند!",
"فیل ها تنها حیواناتی هستند که نمی توانند بپرند.",
"برای حیوانی به نام تنبل 2 هفته طول خواهد کشید تا بتواند غذای خود را هضم کند!",
"تقریبا 3 درصد از یخ های قطب جنوب ادرار پنگوئن ها می باشد",
"خفاش ها همیشه از سمت چپ غار خارج می شوند.",
"زرافه ها تارهای صوتی ندارند",
"حس چشایی پروانه ها در پاهای شان می باشد",
" نزدیک به 150 نفر در سال بر اثر افتادن نارگیل بر روی سرشان جان خود را از دست می دهند",
"چشم های شترمرغ از مغزش بزرگتر است",
"حلزون مي‌تواند 3 سال بخوابد.",
"به طور ميانگين مردم از عنكبوت بيشتر مي‌ترسند تا از مرگ!",
"ملت آمريكا بطور ميانگين روزانه 73000 متر مربع پيتزا مي‌خورند",
"سوسکها سریعترین جانوران ۶ پا می باشند با سرعت یک متردرثانیه.",
"خرگوشها و طوطی ها بدون نیازبه چرخاندن سرخود قادرند پشت سرخود را ببینند.",
"سگهای شهری بطورمتوسط ۳ سال بیشتر از سگهای روستائی عمرمی کنند.",
"درامریکا سالانه ۱۵نفر بر اثر گازگرفتگی توسط سگها جان خود را از دست می دهند.",
"مادروهمسرگراهام بل مخترع تلفن هر دو ناشنوا بودند",
"۱۰ % وزن بدن انسان (بدون آب ) را باکتریها تشکیل می دهند.",
"۱۱% جمعیت جهان را چپ دستان تشکیل می دهند",
" از هر ۱۰ نفر یک نفر در سراسر جهان در جزیره زندگی می کند",
"۹۸ % وزن آب از اکسیژن تشکیل یافته است.",
" زنبور های نر بعد از برقراری رابطه میمیرن.",
"گوسفند ها میتوانند همدیگر را در عکس تشخیص بدهند",
"اسبها قادرند در حالت ایستاده بخوابند.",
"کانگروها قادرند ۳ متر به سمت بالا و ۸ متر به سمت جلو بپرند.",
"قلب میگو در سر آن واقع است.",
"گونه ای از خرگوش قادر است ۱۲ ساعت پس از تولد جفت گیری کند.",
"دارکوب ها قادرند ۲۰ بار در ثانیه به تنه درخت ضربه بزنند.",
"سالانه ۵۰۰ فیلم در امریکا و ۸۰۰ فیلم در هند ساخته میگردد.",
"آدولف هیتلر گیاهخوار بوده است.",
"تمامی پستانداران به استثنای انسان و میمون کور رنگ میباشند.",
"عمر تمساح بیش از ۱۰۰ سال میباشد.",
"تمام قوهای کشور انگلیس جزو دارایی های ملکه انگلیس میباشند.",
"موریانه ها قادرند تا ۲ روز زیر آب زنده بمانند.",
"مزه سیب، پیاز و سیب زمینی یکسان میباشد.و تنها بواسطه بوی آنهاست که طعم های متفاوتی می یابند.",
"فیلها قادرند روزانه ۶۰ گالن آب و ۲۵۰ کیلو گرم یونجه مصرف کنند.",
"جغدها قادر به حرکت دادن چشمان خود در کاسه چشم نمیباشند.",
"۸۰ درصد امواج مایکرو ویو تلفنهای همراه بوسیله سر جذب میگردد.",
"قد فضانوردان هنگامی که در فضا هستند ۵ تا ۷ سانتی متر بلنتر میگردد.",
"بلژیک تنها کشوری است که فیلمهای غیر اخلاقی را سانسور نمیکند.",
"جلیغه ضد گلوله، برف پاک کن شیشه خودرو و پرینتر لیزری همگی اختراعات زنان میباشند.",
"موز پر مصرف ترین میوه کشور امریکا میباشد.",
"۹۸٫۵ % از ژنهای انسان و شامپانزه یکسان میباشند.",
 "قلب انسان بطور متوسط ۱۰۰ هزار بار در سال میتپد.",
"لئوناردو داوینچی مخترع قیچی میباشد.",
"سطح شهر مکزیک سالانه ۲۵ سانتی متر نشست میکند.",
"۵۰ %جمعیت جهان هیچگاه در طول حیات خود از تلفن استفاده نکرده اند.",
"در هر ۵ ثانیه یک کامپیوتر در سطح جهان به ویروس آلوده میگردد.",
"ظروف پلاستیکی ۵۰ هزار سال طول میکشد تا در طبیعت شروع به تجزیه شدن کنند.",
"اغلب مارها دارای ۶ ردیف دندان میباشند.",
"۹۰% سم مارها از پروتئین تشکیل یافته است.",
 "قو بیش از 25000 پر در بدن خود دارد.",
 "نهنگ آبی بزرگترین نهنگ و همچنین بزرگترین حیوان در جهان است.",
 "زرافه ها تار صوتی ندارند.",
 "ستاره دریایی دارای هشت چشم است. یک چشم در انتهای هر پا.",
 "در ایالات متحده تقریبا 60 میلیون سگ وجود دارد.",
 "مگس های خانگی پس از خوردن غذای خوشمزه آن را بالا می آورند تا دوباره بخورند.",
 "موش کور تنها در یک شب می تواند تونلی بطول 300 پا را حفر کند.",
 "علت صورتی رنگ بودن فلامینگو ها این است که میگو منبع اصلی غذای آن هاست.",
" حاصل جفتگیری شیر ماده و ببر نر حیوانی است به نام ” شیببر” است."
 "میانگین سن پرورش بز ماده بین 8 تا 10 ماه است.",
 "فیل ها از طریق خرطوم و مانند نی ، آب نمیخورند.",
 "جنین نهنگ به اندازه یک سوم طول رحم مادر خود رشد می کند.",
 "بزها در فک بالای پیشین دندان ندارند.",
 "شیر بز کلسیم، ویتامین ای و نیاسین بالاتری از شیر گاو دارد.",
 "بوقلمون ها حس بویایی ضعیفی دارند اما در عوض حس چشایی آن ها قوی است.",
 "گربه ها میتوانند فراصوت را بشنوند.",
 "زنبورعسل در درون چشم های خود مو دارند.",
"پنگوئن میتواند 6 پا بیرون از آب بپرند.",
]

texts_chat11 = [
   "اگر از بلندای آسمان بترسی، نمی‌توانی مالکِ ماه شوی! 🌖✨ " ,
   "ناشنوا باش وقتی کهـ به آرزوهای قشنگت میگن محالهـ💘🍀✨ ",
   "هِی زِندِگی میچَرخه…مِثلِ یِ تاس اِمروز حُکم میکُنی…فَردا اِلتِماس",
   "یه عده آدم هستن که میفهمن که نفهمن اما نمی فهمن که میفهمیم نفهمن!",
   "فیلم بازی کردن خوبه اما نه جلو کارگردان…!",
   "شاخ بودن توی فضای مجازی مثل پولدار بودن توی بازی GTA میمونه!",
   "از یه جایی به بعد فقط خودت می مانی و خودت",
   "این حجم از اعتماد ب نفستو گیگی چند میخری؟!",
   "•فِكرایِ توْ سَرَم اَز هَنزفِريم پيچيدِه تَرَن♥",
  "•|چـرا ایـن نیـز دیـگر نـِمـیـگـذَرَد ..:)؟•",
  "دلتنگی هم ﺣﺲ ﺟﺎﻟﺒﯿﺴﺖ ﺩﺍﻍ ﻧﯿﺴﺖ ﺍﻣﺎ میسوزاند … 🥀🖤",
  "+ دختر غمگینو چه به موی بلند 🙂",
  "یع ذهن منفۍ هیچ وقت بهت یع زندگۍ مثبت نخوآهد دآد🖖🏽♥️✨",
  "از دریا اموختم🌹هر کس از حدش گذشت غرقش کنم😍",
  "آرزویت را برآورد میکند ، آن خدایی که آسمان را برای خنداندن گلی میگریاند . . .",
  "از گوش دادن به یه مشت حرف دروغ لذت می‌برم، وقتی‌که حقیقت رو می‌دونم…",
  "هیچ‌کس‌نفهمیدِꔷ͜ꔷ▾‹🖤⃟🌻›” که‌خداوندهمِꔷ͜ꔷ▾‹🥀⃟🕸›” تـــــنـهاییـش‌رافریادزدِꔷ͜ꔷ▾‹🔞⃟🌙›” _قُل‌هُوَاللّهُ‌اَحَدِꔷ͜ꔷ▾‹💔⃟🌿›”",
  "ناشنوا باش وقتی کهـ به آرزوهای قشنگت میگن محالهـ💘🍀✨",
  "اگر از بلندای آسمان بترسی، نمی‌توانی مالکِ ماه شوی! 🌖✨",
  "༺ زندگے ات یـک قصـہ ایـست کـہ توسط یـک خداے خوب نوشتـہ شده! ༻",
  "دنیا از اولشم میزون نبود شیطان عاشق خدا بود..اما خدا عاشق انسان:)",
  "زندگی با زنده بودن فرق ها دارد رفیق❤️",
  "‌انسانها همه چیو نابود میکنند، پنهان زندگی کن‌ !",
  "اگه ماه خوابش ببره، یه شب تورو برمیدارم‌و میذارمت رو آسمون",
  "هیچ لباسی تو دنیا، نمیتونه بی‌شخصیتیه درون آدما رو بپوشونه👌",
  "برات اشک آرزو می‌کنم! نه در اوج غم، در اوج خنده …💛",
  "‌‌‌‌🌿 انقلاب، فقـط لبخنـدش..! (:‌‌‌‌",
  "کی گفته بالاتر عَ سیاهی رنگی نی پ رنگ این روزای زندگیه من چیع؟… 🙂 🥀🖤",
  "پشت تمام آرزوهایم خداایستاده است👌",
  "••قَدعَم میزارَم پابِہ پاتِـ💞جونعمومیــدم مݩ براتــ✨🍂",
  "مردم در خوابند وقتی میمیرند بیدار میشوند…",
  "من تو زندگیم فقط یه قانون دارم،تا خدا هس اصن نباید عاشق باشی…❤️",
  "حَرفِ دِلَم یکَم بُزرگ تَر از دَرک مَغزتہ…😔🖐",
  "عشق آن است، که یوسف بخورد شلاقی، درد تا مغزِه سرُ جانِ زلیخا برود",
  "بَعضیآم هَصدَن اِنقَد قَشَنگ دُروغ میگَن کِع عآدَم حِیفِش میآد باوَر نَکُنِع:)",
  "هیچ کسی از داستان کسی دیگه خبر نداره؛ درد یک سُفره‌ی تک نفرست",
  "حواست به این باشه که وقتی خوشحالی کی برات خوشحاله!",
  "به سݪاݥتے ڱڔگے ڪع تا فهݥید چؤپان خؤاب است باز زؤزه اش را ڪشید تا از پشت خنجڔ نزند 😊😍",
  "آرزو کن شاید بزرگترین آرزوی تو کوچکترین معجزه ی خدا باشه",
  "عمیق ترین معنای زندگی منی.💕 ❣ 💕",
  "تو اوج جوانی شدم یه روانی💃",
  "انقد عاشقت میمونم تاخدا برام ایستاده کف بزنه ^^",
  "اهمیت ندادن بهتر از انتقامه …✌",
  "بیشتر از سن خودم فهمیدم و پیر شدم!",
  "اگر هرگز بدنیا نیامده بودم به کجا برمیخورد؟",
  "زندگی لیلیست،مجنونانه باید زیستن💎💖",
  "در سرزمینی که سایه آدمهای کوچک بزرگ شد در آن سرزمین آفتاب در حال غروب است",
  "چنان بدرخش ، که گویی تمام جهان از آن توست …",
  "مرا به خیر تو امید نیست، شر مرسان.",
  "صِکح بِنـدآز ؛ عَگـح شـیر بُۅد مَ برآے ط اَم عَـگح خَـط بُۅد طُ مآݪ مَ👅😻",
  "❤️من از بیگانگان هرگزننالم که هرچه بر سرم کرداشنا کرد❤️",
  "⌗خـــدایــا..! مــن یــارش؛تـــو↜نـگـهـدارش🙂💜:)️ ",
  "در میان این همه گل گشتم و عاشق نشدم تو چه بودی که تورا دیدم و دیووانه شدم...️ ",
  "هرگز امیدت را از دست نده. هنگامی که خورشید غروب کند، ستاره ها پدیدار  می‌شوند.️ ",
  "برای خودت بجنگ. کس دیگه‌ایی این کارو برات نمی‌کنه .️ ",
  "  خسته از خنده هایِ غمگین!(:🖤 ‌‌️ ",
  "همه چی میگذره ولی از یاد نمیره:) 🙂🤌🏼️ ",
  "به قولِ یه عزیزی ك میگفت :  غم هم اگر ترکم کند تنهای تنها میشوم..🖤  ️ ",
  "ببین من بدترین آدم روي زمین هم که بشم بازم متوجه نمیشم کدوم قسمتش میتونه به تو ربطي داشته باشه! ‌ ️ ",
  "اگ‍‌ه‍‌ ن‍‌اراح‍‌ت‍‌ت‍‌ون ک‍‌ردم‍‌ ن‍‌ب‍‌خ‍‌ش‍‌ی‍‌ن چ‍‌ون اص‍‌ن پ‍‌ش‍‌ی‍‌م‍‌ون ن‍‌ی‍‌س‍‌م ت‍‌ازع خ‍‌وب‍‌م‍ ک‍‌ردم‍‌☻︎𓂀️ ",
  "❉᭄͜͡ـ؋ـقط بـہ آخرش ؋ـکر کن ❉᭄͜͡️ ",
  "یه روز میفهمی زندگی نکردی و حواست به 'چی میشه ها'بوده✨️ ",
  "د اخه نامردا چندتا بغـــــض به یه گلـــــو؟؟؟ ",
  "بیشتَرِ انسان ها قاتِلَن هَمِ انسان ها انسایَت را کشتند🥴🗡 ️ ",
  "هرچی سردتر باهام رفتار کرد بیشتر عاشقش شدم ...🖤🖇 کولرمونو میگم😁😅 ️ ",
  "#تیکه😹✍ تــو چــوب شور بکش ســیــگــآرهنــو وآســت زودعــ😐😕 ️ ",
  "غرق در افکار بی انتها امّا بسی زیبا ...🕊️🤍️ ",
  "همیشه طُ تصمیم میگیری چه ستاره هایی توتاریکی زندگیت بدرخشن! ️ ",
" 언젠가 안아줄게;🕸️💀 روزی در آغوشت خواهم گرفت🕸️💀️ ",
"شاید ندونی ولی تنها دلخوشیم تو این زندگی فقط بودن توعه ؛ آره خود تو...!🦋💙️ ",
"می شود نیمه شبی گوشه ی بین الحرمین من فقط اشک بریزم و تو تماشا بکنی؟ 🥹🖤️ ",
"اونجـایے ڪہ دیدے حرفت ارزش نداره؛ حـرفت رو عـوض نڪـن،جاتـو عوض ڪـن😏️ ",
"درد یعنی همه باشن ولی بازم احساس تنهایی کنی.:(💔 ️ ",
"ح‍‌ک‍‌ای‍‌ت ق‍‌ش‍‌ن‍‌گ‍‌يہ؟! ‍وق‍‌ت‍‌ي داغ‍‌ون‍‌ي ف‍‌قد یہ ن‍‌ف‍‌ر م‍‌ی‍‌ت‍‌ونہ آروم‍‌ت ک‍‌نہ اون‍‌م ه‍‌م‍‌ون‍‌یہ کح داغ‍‌ون‍‌ت ک‍‌رد‍ه.¡ ️ ",
"اگه دیدی دارم با شیطان چایی میخورم،حق قضاوت نداری دارم به راه راست هدایتش میکنم!!! ️ ",
"ار‍ه اق‍‌ای ق‍‌اض‍‌ی ه‍‌رچ‍‌ق‍‌در اع‍‌ت‍‌م‍‌اد ک‍‌ردی‍‌م ری‍‌دن ت‍‌و‍ش!️ ",
"سریع ترین راه🛣️ برای عوض کردن شخصیت🎭 آدما اینه که بهشون بیش از حد توجه کنی🙂 ️ ",
"م‍‌ی‍‌خ‍‌ام ب‍‌ش‍‌م ل‍‌اش‍‌یت‍‌ری‍‌ن د‍‌خ‍‌تر ش‍‌هر:)!️ ",
"مادر کسیه که می‌تونه جای همه رو پُر کنه ولی هیچکسی نمی‌تونه جاش رو بگیره️ ",
"'وُجـودِت' آرامِشِ روحِ مَنه ؛🤍🫀",
"‌ ‌آدمیزاد وقتی یکیو دوست داره، از اون زیباتر براش وجود نداره مثل تو برای من (:🫀🤍•",
"‌•طُ• قشنگ‌ترین بهونه يِ زندگیمي🤍🫀",
"بودَنِتـ شُد آرامِشـِ قَلبـِ مَنـ💙🔗",
"مرا دردیست دور از تو،که نزد توست درمانش:)))))))))",
"هر ثانیه بیشتر از قبل‌ میخوامت:)💊🤍",
"‌خواستم شعری بگویم که تو در آن باشی  یادم آمد که تو خود معنی اشعارِ منی♡'.",
" یِهوٖ شُدَٖم یِ دُخٰترِ آرٖوم بٰا یِ قلَبِ داغٰون..(:",
"ܣࡅ࡙ܥ݆ܨ ܥ‌‌ࡅ࡙ܭَܘ ܧܢܚ݅ࡅ߭ܭَ ࡅ߭ࡅ࡙ܢܚࡅ߳...🚶🏽‍♀🖤",
"‌ تو اصلا میدونی گریه کردن بی صدا چقد سخته؟! 🙂",
"دلم واسه اونموقع هایی که خنده هام واقعی بودم تنگ شده🦋)",
"ما یِ نَسلِ #غَمگین با صورتایِ #شادیم...؛)",
"برنده اونی بودکه بدون فکروخیال خوابید !",
"#یِ ‍روز یِ ج‍‌وری م‍‌ی‍‌رَم کِ ب‍‌ودَن‍‌َم ب‍‌َرات‍‌ون #خ‍‌اط‍‌ِرِح شِح . !.",
"بُزرگتَرین‌ دُروغ‌ِ زندگیم‌ خَندِح‌ های هَمیشِگیم بود:)!",
"هَمه‌دخدَرا‌عروسَکَن‌اما‌مَن#آنابِلَم.🗿",
"واسه قیافه گرفتن باید قیافم داشته باشی🗿✌🏿",
"من انتظار ندارم همه از من خوشش بیاد!!  چون همه خوش سلیقه نیستن:)",
"ایـن راهـی ک دارم مـیرم تهش قشـنگه.. '!",
"‌منو از خودم بپرس من برای همہ یڪی نیستم!📿🖤",
"ی‍‌ادم ن‍‌‌م‍‌ی‍‌اد ج‍‌ای‍‌ی #ام‍‌ض‍‌اء داده‍ ب‍‌اش‍‌م ک‍‌ه‍‌ #ن‍‌ظ‍‌ر ه‍‌م‍‌ه‍‌ ت‍‌ون ب‍‌رام #م‍‌ه‍‌م‍‌ه‍‌ . !",
]

texts_chat21 = [
   "دلبران، دل می برند اما، تو جانم می‌بری…!",
"سر زیبایی چشمان تو دعوا شده است بین ماه و من و یک عده اساتید هنر ",
"یست در گردش جادویی چشمت که هنوز قلم فرشچیان دور خودش می چرخد",
"دیده را فایده آنست که دلبر بیند ور نبیند چه بود فایده بینایی را",
"آنکه برگشت و جفا کرد و به هیچم بفروخت به همه عالمش از من نتوانند خرید",
"عاشقى جرم قشنگیست به انکار مکوش!",
"عشق یعنی در میان صدهزاران مثنوی بوی یک تک بیت ناگه مست و مدهوشت کند",
"کسی ‌سوال‌ می‌کند به خاطر چه زنده‌ ای؟ و من برای زندگی تو را بهانه می‌کنم",
"زندگی بی تو پر از غم شدنش حتمی بود!",
"در اندک من … تویی فراوان",
"چه خوش صید دلم کردی بنازم چشم مستت را که کس مرغان وحشی را از این خوش‌تر نمی گیرد",
"جای مهتاب،به تاریکی شب ها تو بتاب من فدای تو، به جای همه گل ها تو بخند",
"آزرده دل از کوی تو رفتیم و نگفتی کی بود؟ کجا رفت؟ چرا بود و چرا نیست!؟",
"می رود کز ما جدا گردد ولی جان و دل با اوست هر جا می رود",
"جز تو یاری نگرفتیم و نخواهیم گرفت بر همان عهد که بودیم بر آنیم هنوز…",
"همین که گاه به من فکر می‌کنی کافیست بمان و پشت سرم عاشقانه غیبت کن",
"غم دل با تو نگویم که نداری غم دل با کسی حال توان گفت که حالی دارد…!",
"تا که از جانب معشوقه نباشد کششی کوشش عاشق بیچاره به جایی نرسد",
"دلبر عاشق سرشت من ای آنکه چشمهای سیاهت بهشت من است",
"با آن همه دلداده دلش بسته ی ما شد ای من به فدای دل دیوانه پسندش",
"اگر باغ نگاهم پر ز خار است، گلم تاراج دست روزگار است به چشمانت قسم، با بودن تو، زمستانی ترین روزم بهار است",
"یک بوسه ز تو خواستم و شش دادی شاگرد که بودی که چنین استادی خوبی و کرم را چو نکو بنیادی ای دنیا را ز تو هزار آزادی",
"زرد شدست باغ جان از غم هجر چون خزان کی برسد بهار تو تا بنماییش نما",
"سیر نمیشوم ز تو، اي مه جان فزای من جور مکن، جفا مکن، نیست جفا سزای من",
"دلبرا پیش وجودت همه خوبان عدمند سروران بر در سودای تو خاک قدمند",
"گفتی نظر خطاست تو دل می‌ بری رواست خود کرده جرم و خلق گنه کار می‌ کنی",
"چنان به موی تو آشفته‌ ام به بوی تو مست که نیستم خبر از هر چه در دو عالم هست",
"تا خیال قد و بالای تو در فکر منست گر خلایق همه سروند چو سرو آزادم",
"گر فلاطون به حکیمی مرض عشق بپوشد عاقبت پرده برافتد ز سر راز نهانش",
"گفتیم عشق را به صبوری دوا کنیم هر روز عشق بیشتر و صبر کمتر است",
"آن که نقشی دیگرش جایی مصور می‌شود نقش او در چشم ما هر روز خوشتر می‌شود",
"خوشتر از دوران عشق ایام نیست بامداد عاشقان را شام نیست",
"تو همچون گل ز خندیدن لبت با هم نمی‌ آید روا داری که من بلبل چو بوتیمار بنشینم",
"دلبرا خورشید تابان ذره‌ ایی از روی تست",
"در هوایت بی قرارم روز و شب سر ز پایت بر ندارم روز و شب",
"هر چه گویی آخری دارد به غیر از حرف عشق کاین همه گفتند و آخر نیست این افسانه را",
"تو همانی که دلم لک زده لبخندش را او که هرگز نتوان یافت همانندش را …",
"برگ درختان سبز در نظر هوشیار هر ورقش دفتری ست معرفت کردگار",
"هر چه گویی آخری دارد به غیر از حرف عشق کاین همه گفتند و آخر نیست این افسانه را",
]

texts_chatn = {
    "چرا",
    "چیزی شده",
    "عشقم چی شد",
    "ای بابا",
}

texts_chat22 = {
    "خب بکیرم",
    "بکتفم",
    "اهمیت ندارد",
}
texts_chat19 = [
    "تو کونت",
    "تو دهنت",
    "فحش نده تو گروه",
    "تو کون بدخواهت ستون",
]

texts_chat18 = [
    "http://pornhober12.wuaze.com/ با فیلترشکن وارد شوید ",
]

texts_chat17 = [
    "من بیام عزیزم",
    "من ریپم تو بیا",
    "سیکتیر هول",
    "هول چه زیاد شده",
]

texts_chat16 = [
"آن چیست که دست دارد، اما نمی‌تواند کف بزند؟",
"آن چیست که چشم دارد، اما نمی‌تواند ببیند؟",
"ن چه چیزی است که می‌تواند به سراسر دنیا سفر کند در حالی که در یک گوشه نشسته است؟",
"آن چیست که سر دارد، اما بدن ندارد؟",
"کجاست که رودخانه هایش بدون آب، شهر هایش بدون ساختمان و جنگل هایش بدون درخت هستند؟",
"اگر هواپیما در مرز بین آمریکا و کانادا سقوط کند ، بازماندگان را کجا دفن می کنند؟",
"ن چیست که دو دفعه اول به رایگان هرکس داده می‌شود، ولی دفعه سوم باید پول آن را بدهید؟",
"من وقتی جوان هستم قد بلندی دارم و وقتی پیر شدم کوتاه قد می‌شوم. من چه هستم؟",
"آن چیست که خیس می‌شود تا شما خشک بشوید؟",
"آن چیست که اگر غذا به آن بدهی زنده است و اگر آب به آن بدهی می‌میرد؟",
"کدام دو پرنده هستند که هر کدام برعکسش نام پرنده دیگری است؟",
" آن کدام جانور است که دو حرف اولش تکراری است؟",
" کدام پرنده است که هم نام یک شهر غربی کشور عزیزمان است؟",
" کدام میوه است که یک نام خانوادگی به اسم آن وجود دارد؟",
" آن کدام میوه‌ است که سه حرف اولش نام یک کشور است؟",
"آن نام کدام خودرو است که سه حرف اولش نور می دهد؟",
" کدام شهر ایران است که دو حرف آخر آن، سوغات اصفهان است؟",
"آن چیست که رنگش مانند برف و طعمش مانند عسل اسـت؟",
" کدام آش است که از هر طرف بخوانیم، باز هم همان آش می‌شود؟",
" آن کدام حبوبات است که دو حرف اولش یک ابزار خیاطی است",
"آن کدام چیز ترش است که دو حرف اولش عضو بدن است",
"من اول خشک ‌می‌ شوم و هر چه بیشتر شنا می‌ کنم، پررنگ‌ تر می‌ شوم. من چی هستم؟",
" کدام ورزش است که اگر دو حرف آخر آن را برداریم، مکانی برای تفریح می‌شود؟",
""
]

texts_chat15 = [
    "لپات  بادمجون",
    "کیر",
    "جون",
    "بده بزنیم",
]

texts_chat14 = [
    "کص عمت",
    "ممد کجای این خر صدات میکنه",
    "ممد دوست داری",
    "ممدا هولن ها",
]

texts_chat13 = [
    "منم دوست دارم",
    "خیلی میخامت گل",
    "ای جان با من رل میزنی",
    "قلبمیا",
    "فدات شم",
    "دلبرمی",
]

texts_chat12 = [
  "چه رفتاری برای تو بیشتر از همه جذاب است؟",
  "به کی حسودی می‌کنی؟",
  "تا به حال به یارت دروغ گفتی؟ چه دروغی؟",
  "در حال حاضر از کی خوشت میاد؟",
  "پنج پسر اولی که به نظرت جذابن رو نام ببر؟",
  "بعضی از ناامنی‌هایی که تو رابطه‌ت حس می‌کنی رو نام ببر.",
  "دوست داری چندتا بچه داشته باشی؟",
  "گر مجبور باشی با یکی از پسر‌ها / دختر‌های این جمع ازدواج کنی، کدام را انتخاب می‌کنی؟",
 "به چه کسی توی این جمع حسادت می‌کنی؟",
 "کی توی این جمع از همه خنده‌دارتره؟",
 "آیا به نظر خودت خوش قیافه و زیبا هستی؟",
 "عشق به نظرتون چه رنگیه؟",
"اگر به عشقت نرسی چی کار میکنی ؟",
"یک واقعیت آزار دهنده راجب خودت بگو؟",
"تو جمع ازکی خوشت میاد از کی بدت میاد ؟",
"تا حالا مواد مخدر مصرف کردی؟",
"آخرین باری که رختخوابت رو خیس کردی کی بوده؟",
"تا حالا توی خیابون لیز خوردی بقیه ببینن بخندن ؟واکنشت چی بود؟",
"چه کاری رو هنوز پدر و مادرت برات انجام می‌دن؟",
"تا به حال چندبار توی استخر دستشویی کردی؟",
"آخرین چیزی که امروز روی گوشی جستجو کردی چی بوده؟",
"اصلی‌ترین چیزی که توی جنس مقابل برای تو جذابه چیه؟",
"معیارهات برای ورود به یک رابطه چی هستن؟",
"یه قسمت خنده‌دار از اولین تجربه‌ی پرحرارت زندگیت رو تعریف کن؟",
"تا به حال شده پسری که دوستش داری بفهمه، و بهت جواب منفی بده؟",
"اگر می‌تونستی یک چیز در بدنت رو تغییر بدی اون چی بود؟",
"بزرگ ترین رازت چیه؟",
"فوبیای خاصی داری؟ چیه؟",
"چه چیزی باعث خجالتت میشه؟",
"خجالت آورترین اتفاقی که تاحالا برات افتاده؟",
"بزرگترین اشتباهی که تاحالا مرتکب شدی؟",
"توی چه کاری اصلا خوب نیستی؟",
"بزرگ ترین دروغی که تا حالا گفتی؟",
"تا حالا توی بازی تقلب کردی؟",
"تا حالا سر امتحان تقلب کردی؟",
"عجیب ترین عادتی که داری؟",
"توی این جمع، کی رو بیشتر از همه دوست داری؟",
"بدترین شوخی که با یکی از بازیکنان جمع داشتی چی بوده؟",
"بی استعدادترین آدم این جمع برای خوانندگی؟",
"اگر به مدت یک ماه جنس مخالف خودت بودی، چه کارهایی می‌کردی؟",
"باهوش ترین آدم این جمع کیه؟",
"زرنگ‌ترین آدم این جمع توی مخ زنی کیه؟",
"به نظرت کی توی جمع از همه خنگ‌‍تره؟",
"به نظرت تنبل ترین آدم این جمع کیه؟",
"شکست عشقی خوردی؟ کی بوده؟",
"تا حالا تو استخر جیش کردی؟ راستشو بگو 🙂",
"بدترین ویژگی بغل دستی ات چیه؟",
"خوشکل‌ترین آدم جمع کیه؟",
"راز مهم یکی از بازیکنای جمع رو بگو",
"دردناک ترین تجربه جسمی ات چه بوده است؟",
"اگر غول چراغ جادو داشته باشی سه آرزویت چیست؟",
"احمقانه ترین کاری که مقابل آینه انجام داده ای چه کاری بوده است؟",
"بیشتر از همه به چه کسی حسادت می کنی؟",
"اگر مطمئن باشی هیچ وقت زندانی نمی شوی دوست داری چه کسی را بکشی؟",
"آیا تا به حال درباره سن خود دروغ گفتی؟",
"آخرین باری که گریه کردی چه زمانی بود؟",
"موردی که بیشتر از همه دوست داری در زندگی ات تغییر دهی چیست؟ ",
"کی توی این جمع از همه بیشتر خالی می بنده؟",
"از کی توی این جمع بیشتر از همه دلخور شدی؟",
"صمیمی ترین دوستت کیه؟",
"بهترین دوستی که توی زندگی داشتی کی بوده؟",
"به کی توی دنیا بیشتر از همه غبطه می خوری؟",
 "به نظرت مخاطب خاص تو، کیس ازدواج هست؟",
 "تا حالا شده به همسرت دروغ بگی تا از نزدیک شدن بهش اجتناب کنی؟",
 "دوست داری چه چیزی در مورد مخاطب خاصت تغییر کنه؟",
 "چه کسی رو پنهانی دوست داری؟",
 "تا به حال به همسرت / مخاطب خاصت خیانت کردی؟",
 "اصلی‌ترین چیزی که توی جنس مقابل برای تو جذابه چیه؟",
 "معیارهات برای ورود به یک رابطه چی هستن؟",
 "در مورد اولین تجربه‌ی عاشقانه‌ت بگو.",
"یه قسمت خنده‌دار از اولین تجربه‌ی پرحرارت زندگیت رو تعریف کن.",
 "بدترین ویژگی بغل دستیت چیه؟",
 "اگه فقط ۲۴ ساعت از زندگیت مونده باشه، دوست داری به کی ابراز محبت کنی و اولین نفری که بهش در مورد مرگت خبر می‌دی کیه؟",
 "چه نوع رابطه‌ای دوست داری؛ ماجراجویانه و پرحرارت یا آروم و ساکت؟",
 "اسم ۵ تا پسر / دختر که همه بشناسیم رو بگو و از ۱ تا ۱۰ بهشون نمره بده.",
 "جذاب‌ترین لباسی که تا حالا توی خلوت پوشیدی رو توصیف کن.",
 "با کسی که فقط یکبار دیدیش، دیگه هم قرار نیست ببنیش، اما ازش خوشت میاد چکار می‌کنی؟",
"اولین عشقت کی بوده؟",
"چه سوالی رو دوست نداری توی این بازی جواب بدی؟",
 "یکی از فانتزی‌های عاشقانه‌ت رو توصیف کن.",
 "بزرگترین ترست توی یک رابطه چیه؟",
 "دوست داری عشقت چطوری ازت قدردانی کنه؟",
 "آیا از سورپرایز شدن خوشت میاد؟",
 "یک قرار عاشقانه‌ی عالی از نظر تو چطوریه؟",
 "مناسب‌ترین سن برای ازدواج از نظر تو چه سنیه؟",
 "دوست داری چندتا بچه داشته باشی؟",
 "از من خوشت میاد؟",
 "بعضی از ناامنی‌هایی که تو رابطه‌ت حس می‌کنی رو نام ببر.",
 "از رابطه‌ی قبلیت برامون بگو.",
 "یک دروغ که توی رابطت گفتی رو تعریف کن.",
 "تا حالا به کسی از جنس خودت جذب شدی؟",
 "چه چیزی در مورد من رو نمی‌پسندی؟",
 "چه چیزی در مورد من رو دوست داری؟",
 "اگر مجبور باشی با یکی از پسر‌ها / دختر‌های این جمع ازدواج کنی، کدام را انتخاب می‌کنی؟",
 "تا حالا با کسی چت رمانتیک داشتی؟ اگر آره اون متن رو بخون.",
 "آهنگ مورد علاقت چیه؟",
 "برای اینکه نظر دختر / پسری رو به خودت جلب کنی چکار می‌کنی؟",
 "تا حالا با چند نفر وارد رابطه شدی؟",
 "به چه کسی توی این جمع حسادت می‌کنی؟",
 "تا حالا خواب منو دیدی؟",
 "از گفتن چه چیزی به من بیش از همه می‌ترسی؟",
"اگر  هرچیزی که می‌خواستی رو می‌تونستی بخری، چی می‌خریدی؟",
]
texts_chat10 = [
    "خوش اومدی عشقمون",
    "کاشکی نمیومدی",
    "ای جان",
    "خوب شد تاومدی",
]

texts_chat9 = [
    "مراقبت کن خدافظ",
    "بای عزیزم",
    "میموندی خوش میگذشت",
    "منم با خودت ببر",
    "نرو سمیه",
    "سیک",
    "گپ بدون تو حال نمیده",
]

texts_chat8 = [
    "توت باشه بخندی",
    "فدای خنده هات بشم",
    "تو فقط بخند",
    "ای جان عشقم خندید",
]

texts_chat7 = [
    "دسته تبر",
    "خبری نیس خبرا پیشه توعه",
    "سلامتیت دلبر",
    "به تو مربوط نیس",
]

texts_chat6 = [
    "خداروشکر",
    "شکر",
    "همیشه خوب باشی عزیزم",
    "ای جان",
    "افرین دلبرم خوب باش",
]

texts_chat4 = [
    "کیونی صدام نکن",
    "به تو نمیرسه اسم من صدا کنی",
    "تو اصلا از بابات اجازه گرفتی با من حرف بزنی",
    "انقدر صدا نکن جف پا میام تو صورت",
    "جانم نفسم",
    "بنال",
    "بله قربان",
    "انقدر خایمالی نکن",
    "میخای بکنمت انقدر صدا میکنی",
    "جون",
    "بمیر انقدر صدا نکن",
    "میخوام بخوابم",
    "جونم زندگی",
]

texts_chat1 = [

      "خوبم تو خوبی",
         "مرسی ",
     "به تو مربوط نیست",

]


texts_chat = [
    "سلام",
    "های بیبی",
    "خوبی",
    "صلوم",
    "چطوری جیندا",
    "ای جان ببین چه کسی اومد",
]

texts_chat3 = [
    "کص ننت",
    "مادر جنده چرا فحش میده باید کونت بزارم",
    "کونت گزاشتن فحش میدی",
    "هی کونکش فحش نده",
    "دفعه بعدی فحش بدی ریم میشی",
    "کونی",
    "کیونی",
    "تو کی مدت شدی",
    "جوابت نمیدم ادم نیستی"
]

texts_bot = [
  "عزیزم اسم من تایگر",
  "ربات نگو بگو تایگر",
  "ممنون میشم بگید تایگر",
]
texts_chat2 = [
    "بخوبیت عزیزم",
    "فداتشم",
    "تو خوب باشی منم خوبم",
    "نه خوب نیستم",
    "نمیدونم",
    "به تو مربوط نیست",
]
texts_chats = [
    "جونم زندگی",
    "هان",
    "جان عزیزم",
    "چی میخوای",
    "واو جان",
]
texts_chatt = [
    "فشار نمیخورم",
    "تو بخور",
    "انقدر نگو",
]
texts_chatr = [
    "نشو لازمی",
    "فدام نشو بمونی براش",
    "من فدات بشم",
    "قلبمی",
]
texts_chatq = [
   "لیلای من دریای من آسوده در رویای من   این لحظه در هوای تو گم شده در صدای تو من عاشقم مجنون تو گمگشته در بارون تو مجنون لیلی بی‌خبر در کوچه هاي در به در مست و پریشون و خراب هر آرزو نقش بر آب شاید که روزی عاقبت آروم بگیرد در دلت",
   """چرا رفتی چرا من بیقرارم به سر سودای آغوش تو دارم

نگفتی ماه تاب امشب چه زیباست ندیدی جانم از غم ناشکیباست

چرا رفتی چرا من بیقرارم به سر سودای آغوش تو دارم

خیالت گرچه عمری یار من بود امیدت گرچه در پندار من بود

بیا امشب شرابی دیگرم ده زمینای حقیقت ساغرم ده

چرا رفتی چرا من بیقرارم به سر سودای آغوش تو دارم""",

"""بی‌هوا نوازشم کن، اشک وغصه‌هامو کم کن

با نگاه بی‌قرارت باز دوباره عاشقم کن

اشک و غصه‌هامو کم کن

قلب من بهونه داره، حرف عاشقونه داره

راه دیگه اي نداره، غیر از این که باز دوباره

سر رو شونه هات بذاره""",

"""آیندمون آینده ای روشن
حرف جدایی رو نزن با من
فردای خوبی پیش رومونه،
دنیا به رفتار تو مدیونه
حالا که خوبیت عاشقم کرده
این عاشقِ دورِ تو میگرده
از هرکس و هرچیز بهتر باش
با من از این هم مهربون تر باش
تـــــــــــــــرکــــــــــم نکـــــــــــــن
من بی تو بیمارم،دیونه وار دوست دارم
من پیشتم، تنهات نمیزارم
تا با منی هیشکی نمی تونه
قلب تورو از غم بلرزونه
تا با منی پشت سرت کوهه
روزای تو بی درد و اندوهه
هرچی که تو دستامه می بخشم
دنیای من شعرامه می بخشم
می بخشم از عمرم به تو حتی
وقتی نباشی میرم از دنیا""",

"""چند وقت که برات اهمیت نداره گریه های من

خلوت شبات دیگه شده غریبه با صدای من

زندگی تو از آرزو و حال و روز من جداست

حالا که تو شدی یه آدم غریب و سرد و  بی هواس

من از این شهر میرم شهری که ستاره هاش خاموش

معشوق عاشقش رو می فروشه به هیچ و پوچ زندگی

من از این شهر میرم شهری که به ظاهر آشنا زیاده

اما تو نمی دونی درد هات رو تو تنهایی به کی بگی

♫♫♫♫♫♫

♫♫♫♫♫♫

خسته از عروسک ها تو لباس آدم ها

تنها و بی صدا قم میشم تو جاده ها

میرم بی خداحافظی

بی امید بی هوا میرم از هوای تو جدا

دونبال ستاره ها به سمت نا کجا

میرم بی خداحافظی

اون که عاشق تو بود از ته دلش منم

اما این روزا بودن و نبودنم فرقی نداره.واسه تو

رنگ شب شدی یادت رفته نور

هر چراغ روشنی حتی از راه دور

پرت می کنه هواست رو

من از شهر میرم شهری که گذشته ها و پوشونده

همه خاطرات خوبمون اونجا بوده

تو تموم کوچه ها

من از این شهر میرم

تو بمون و آدم های بی سایه عاشقانه های بی پایه

تو فکر موندنم نباش

من از این شهر میرم شهری که ستاره هاش خاموش

معشوق عاشقش رو می فروشه به هیچ و پوچ زندگی

من از این شهر میرم شهری که به ظاهر آشنا زیاده

اما تو نمی دونی درد هات رو تو تنهایی به کی بگی""",

"""منو جون پناه خودت کن٬ برو
بذار پای این آرزو واستم
به هرکی بهم گفت ازت رد شده
قسم میخورم من خودم خواستم
منو جون پناه خودت کن٬ برو
من از زخم هایی که خوردم پرم
تو باید از این پله بالا بری
تو بالا نری من زمین میخورم

درست لحظه ای که تو باید بری
اسیر یه احساس مبهم شدی
ببین بعد یک عمر پر پر زدن
چه جای بدی عاشق هم شدیم

برای تو مردن شده آرزوم
یه حقی که من دارم از زندگی
نگاه کن تو این برزخ لعنتی
چه مرگی طلبکارم از زندگی

به هرجا رسیدم به عشق تو بود
کنار تو هرچی بگی داشتم
ببین پای تاوان عشقم به تو
عجب حسرتی تو دلم کاشتم
اگه فکر احساسمونی برو
اگه عاشق هر دومونی برو
تو این نقطه از زندگی مرگ هم
نمیتونه از من بگیره تو رو""",

"""نه میگم برگرد نه میگم اینجا خوبه بی تو
نه میگم ول کن واسه من کلِّ زندگیتو
نه میگم قلبم نمیتپه بی تو
میتپه؛ اما خب یه چیز دیگه ای تو
نه ازت میخوام که واسه من سفر کنی
نه تو اصن دوست داری که خطر کنی
میگذرونم من هر طوری بشه
همه روزام شدن یه شکل
بذار جونم برات بگه ببین چقده داغونم
بیا بذار دلم دوباره زنده شه

من دلم تنگه واسه یه دلخوشی کوچیک
واسه یه همسفر ساده که باهاش
بزنم جر بدم این جاده رو با موزیک
من دلم تنگه واسه یه دلخوشی کوچیک
واسه یه همسفر ساده که باهاش
بزنم جر بدم این جاده رو با موزیک

آه
بعضی موقع ها همه چی هست
بجز اونی که باید باشه
ام
مثلا یه بچه تنها که اسباب بازی هم داره ها
ولی کسی نیست که باهاش با همون اسباب بازیِ بازی کنه
اون موقع است که با همه قهر میکنه
حتی با اسباب بازیش

من باهات قهرم
ولی بی تو خب انگار با همه عالم غریبم
من باهات قهرم
با این که هر شبو با گریه از خوابم پریدم
با همه قهرم اصن این دور و بر آدم ندیدم
هر چقدر حال دادم هی دادن فریبم
ببین اینا چین که بینشون این من تیکه پاره آدم ترینم

تمومِ راهروهای خونه رو شمع که بچینی
من باهات قهرم
میدونی تا خود صبح پیش من شب که بشینی هم باهات قهرم
بذار اصلاً من از چشمت بیفتم که ازت خونه دلم
برو دور شو ازم جون دلم
بذار از این به بعد اصن منو بچه ببینی
من باهات قهرم

من باهات قهرم ولی خب تنها ترین آدم این شهرم
یه دل میگه که برگردم
یه دل میگه با بدبختی و تازه تو رو ترک کردم
من باهات قهرم تو فقط فکر خودت بودی و بس
تو فقط ساختی از این خونه قفس
تو اصن نمیفهمی هیچی به جز بوی هوس
فکر کنم این رابطه تموم شده ست

تمومِ راهروهای خونه رو شمع که بچینی
من باهات قهرم
میدونی تا خود صبح پیش من شب که بشینی هم باهات قهرم
بذار اصلاً من از چشمت بیفتم که ازت خونه دلم
برو دور شو ازم جون دلم
بذار از این به بعد اصن منو بچه ببینی
من باهات قهرم

بله!
میشه از تنهایی یه قلب شد و ضربان زد
یعنی میشه فوران نکرد و دور نریخت
میشه به هم زد و موشکافت و نبض پیدا کرد
میشه از بغض به هنر رسید و از اشک به ساز

میزنم گیتار و میخونم میزنی زار و میدونی
من اینجوری خالی میشم تو اینجوری نمیتونی
میرم تو ماشین و فقط با یه موزیک داد میزنم
میرم ولی یادت نره برنده ی بازی منم
برو و دوراتو بزن میرم و دور نمیزنم
برو و غراتو بزن میرم و غر نمیزنم
میرم و کل این تنم پره از زخم توئه
دل من پر پره اما میرم و غنچه میزنم

من دلم تنگه واسه یه دلخوشی کوچیک
واسه یه همسفر ساده که باهاش
بزنم جر بدم این جاده رو با موزیک
من دلم تنگه واسه یه دلخوشی کوچیک
واسه یه همسفر ساده که باهاش
بزنم جر بدم این جاده رو با موزیک

آ
بعضی وقتا
وضعیت انقد قرمز نیست که آژیرو بکشن
اما همون آژیروقتی به صدا در میاد
خیلی از وضعیتا رو قرمز میکنه
پس یه وقتا بهترین کار سکوته و
سکوت یعنی قهر""",

"""صبح که تو چشمای تو خیره میشم؛ زندگی تازه شروع میشه برام…
من از با تو بودن به خدا سرد نمیشم؛ تن تو تن تو آتیشه برام!
تو این اتاق پیچیده عطر تن تو؛ بیا بازم منو تو آغوشت بگیر…
دوست دارم وقتی که نزدیکمی؛ اسممو آروم توی گوشم بگی
دست من نیست تو عزیز جونمی!
خودت نمیدونی همه بود و نبودمی…

دست من نیست؛ ای عشق ستودنی!
هر کاری بخوای میکنم بیای سمتم تو؛ نمیدونم چیکار کردم شدی سهمم تو!
تو مثل هوای خوب بعد بارونی! تو بیای میکنم شهرو چراغونی…
دست من نیست تو عزیز جونمی!
خودت نمیدونی همه بود و نبودمی…
دست من نیست؛ ای عشق ستودنی!""",

"""حالا که همش تو رویاست بذار دلتنگت بمونم

مرگ بیداری برا من اینو خیلی خوب می دونم

بذار عاشقت بمونم بذار عاشقت بمونم

بذار عاشقت بمونم

قلب من می گه که هستی اما چشمام می گه نیستی

خیلی سخته باورم شه که تو پیشم دیگه نیستی

بگو که هنوز چشاتو رو به عشق من نبستی

چشم من می گه تو رفتی اما قلبم می گه هستی

مگه میشه تو نباشی تو مثه نفس می مونی

دستای گرمتو کاشکی تو به دستم برسونی

دستم بی تو بی پناه ِ می میرم وقتی نیستی

مگه میشه باورم شه که تو پیشم دیگه نیستی

حالا که همش خیاله بذار دستاتو بگیرم

بذار تو فرض محالم با تو باشم تا بمیرم

بذار عاشقت بمونم بذار عاشقت بمونم

حالا که همش تو رویاست بذار دلتنگت بمونم

مرگ بیداری برا من اینو خیلی خوب می دونم

بذار عاشقت بمونم بذار عاشقت بمونم

بذار عاشقت بمونم…""",

"""عازیزکه ی مه پروانه ی خیال بگرمه باوش بورم ورو مال

خوت زانی حالم ناسازی توای ارا چه اویشی داخت چه بوه

عازیزکه ی من نازارگی مال له خطام بگذره من بکه حلال

وه خدا شاو و روز فکرم ها ه لات نویشه پیم بچو دلگیرم ارات

عازیزکی من نازار ایلام دیشاو دیمه خواو خفتیته له لام

مگر له ناو خواو بگرم دسیلت سجاد وه قربان مسی چاویلت""",

"""مثل گل نشستی توو باغچه قلبم
درمون دردم، با همه سردم
با توو گرم، دردمون دردم
مثل ماه میمونی توو شب های تنهایی من
میخوام تا بخوابی دم گوشت لالایی بگم
میشه دست بکشم مرتب کنم موهات رو من
میخوام تا میتونم جلو همه پزت رو بدم
زندگی میره جلو مشتی واره
عین آقا تختی عاشق شدم، عاشق قدرت
وایمیستم روو بلندی
تو هم بغلم وایستادی
نداریم انرژی منفی، مثل خودم جنگی
مهربونم و گنگی
مثل گل نشستی توو باغچه قلبم
درمون دردم، با همه سردم
با توو گرم، دردمون دردم
مثل ماه میمونی توو شب های تنهایی من
میخوام تا بخوابی دم گوشت لالایی بگم
میشه دست بکشم مرتب کنم موهات رو من
میخوام تا میتونم جلو همه پزت رو بدم
امان از نگاه تو، که توو ذهنم میمونه
صدای تو، توو گوشم میمونه
میگه بمون با من، دَووم بیار
من عاشقم، با من بیا
مثل یه پروانه میگردم همش دور تو
کسی به چشم نمیاد بعد از خود تو
مثل گل نشستی توو باغچه قلبم
درمون دردم، با همه سردم
با توو گرم، دردمون دردم
مثل ماه میمونی توو شب های تنهایی من
میخوام تا بخوابی دم گوشت لالایی بگم
میشه دست بکشم مرتب کنم موهات رو من
میخوام تا میتونم جلو همه پزت رو بدم""",

"""یه جای تک داری توی دلم
نشده جات رو به کسی بدم
مثل یه رازی توو قلبم نمیشه
راز چشم هات رو به کسی بگم
هیچکی قشنگتر نبود ازت
کشیدی پای دلم رو وسط
نمیخواستم جز تو کسی رو
من میخواستم تو رو فقط
این دیوونه حق داره
بعضی وقت ها بی دلیل بد بشه اخلاقش
ساکت شه بی اعصابه
چون یه چیزهایی نمیره دیگه از یادش
این دیوونه حق داره
شاکی باشه هر کی دنبال دستاته
ساده نگهداره عشقت رو با اینکه یه عادت دردناکه
دوست دارم مثل قدیم بشینی کنارم و تهران رو دور بزنم
دستت رو بگیرم و دوباره بریم بیرون من واست گل بخرم
دوست دارم نصف شب ها بزنم بیرون و تو بیای پشت سرم
بگی من پایتم، منم با خودت ببر من بهت زل بزنم
این دیوونه حق داره
بعضی وقت ها بی دلیل بد بشه اخلاقش
ساکت شه بی اعصابه
چون یه چیزهایی نمیره دیگه از یادش
این دیوونه حق داره
شاکی باشه هر کی دنبال دستاته
ساده نگهداره عشقت رو با اینکه یه عادت دردناکه""",

"""تموم کار من بی تو بده حال من، کوتاه بیا
بذار تا بشنوم صدای نازت رو، تو مثل سازی ها
بیا و بگذر از کسایی که همیشه توی شادی ها
بیا و بشکن این غرور لعنتی رو واسه من بخند
دوباره عاشقی کن دوباره زندگی کن بخند
بیا و بشکن این غرور لعنتی رو واسه من بخند
دوباره عاشقی کن دوباره زندگی کن بخند، بخند
همیشه پیشتم رفیق روز بدت ام اینه عادتم، عادتم
غرور رو بشکن و بگو همیشه پشتتم، مثل سایتم، سایتم
بیا و بشکن این غرور لعنتی رو واسه من بخند
دوباره عاشقی کن دوباره زندگی کن بخند
بیا و بشکن این غرور لعنتی رو واسه من بخند
دوباره عاشقی کن دوباره زندگی کن بخند، بخند""",

"""خدا نزدیک تر شد وقتی من غمگین
داشتم تنها توی دردام می‌مردم
همیشه زنجیره سنگینه تقدیرو
با یادش از پاهای زخمیم در آوردم
روزگار هرچقدر سخت بود
دستامو میگرفت محکم
پادشاه زمین و آسمان را سپاس و سپاس و سپاس
به نام رعد و برق و دریا آسمون نیلگون معرفت ابرها
کسی حواسش به تو نیست دختر
مادرت که مرد پدرت رفت به سمت هروئین
مجبوری نصف شبو پا بدی به پلیس
تا بری تو ماشینا و بزنی یه ربع لیس
کسی حواسش به تو نیست پسر
خرج شیمیایی پدرت افتاده گردن تو
رو میز قاضی دیدم نوشته پرونده کلت پی یه خفت گیر
دادگاهیته پنج شنبه صبح
کسی حواسش به تو نیست مرد
میگردی دنبال یه لقمه نون حلال تو شرکت مواد غذایی فامیلتون
جیبت خالیه پول نیس پس ببین تو راضی بمون
اگه اختلاسای شرکتو رو بکنی میکننت راهیِ گور
زنت کنارت کار میکنه باقیه روز
خوشحالین از این که بچه تون
هه
تو خونه خوابیده خوب
کسی حواسش به تو نیست پیرمرد
تو که خاطره هاتو میبری پیش مرگ
رویاها تو گذاشتی برای بچه هات و نوه هات
تو وصیت نامه ی زیر سر
کسی حواسش به تو نیست خدا
نمیدونن مال و طلای دنیارو سپردی دست شیطان
بعضیا هرچی بدتر میشن ثروتمندتر میشننمیدونم هم از کجا
کسی حواسش به ما نیست ..
تکست آهنگ رضا پیشرو کسی حواسش به تو نیست
خدا نزدیکتر شد وقتی من غمگین
داشتم تنها توی دردام میمردم
همیشه زنجیره سنگینه تقدیرو
با یادش از پاهای زخمیم در آوردم
روزگار هرچقدر سخت بود
دستامو میگرفت محکم
به نام چشمای خیس
کسی حواسش به تو نیست
آ.. بهشون بگو
همه میخوان حقیقتو بدونن
اول باید چشمای کثیف همو بشورن
قبل از اینکه خاکستر زمینمو ببوسن
قبل گوش دادن به من دلیل رپو بدونن
همه آزادی رو واسه خودشون میخوان
با همه چی موافقن تا وقتی خوششون میاد
اگه تورو انتخاب کنن بهت احترام میزارن حتی اگه با خرت از نوک کوه بیای
دست نوشت آرزوها پشت هم خیس
رفیق همه پیرشدیم کسی تخ.مشم نیس
وقتی خودمون تو خودمون یه رفیق نداریم
چطور میشه اعتماد کنیم به حکم هفت تیر
این موج منفی که ایرانو ول نمیکنه ملیتی نمیفهمش تا وقتی زندگیش کنه
وقتی رویای جوونا پر چرک نویس شده
پدر ناتنی میکنه و فکر نمیکنه
زنده اید و داره میمیره و گریه میکنه
اون تو توهمش فکر میکنه چنجه میخوره
چیزی حس نمیکنه چون تو مخش پره دوده
وقتی میبینیش تیر میکشه استخوان روحت
هیچکدوم از ما به وسط قانع نیستیم
همه شاه و اسطوره و قهرمان ریسکیم
از زمانه حقو میخوایم در زمانه نیستیم
سال هاست تنها و احمقانه زیستیم
نمیدونیم حتی یه خط از زبان میخی
خیلی زود سریع با یه حرف هم قانع میشیم
نفت که مال ما نیست
سهم ما میمونه همه هفته های پاییز
با تفره های قاضی
کسی حواسش به ما نیست
***تکست : رضا پیشرو***
ترانه شعر آهنگ رضا پیشرو کسی حواسش به تو نیست""",
]
texts_chato = [
"@robot01920 اموزش ساخت"
]
texts_chatz= [ """قوانین
              [لینک ممنوع]
              [فحش ممنوع]
              [دعوا ممنوع]
              [ کیر گوزی ممنوع]
              [ادم باشید]"""
              ]

def getAds(string: str) -> bool:
    string = string.lower()
    for filter in my_filters:
        if filter in string:
            return True
        else:
            continue
    return False


def getInsults(string: str) -> bool:
    for filter in my_insults:
        if filter in string:
            return True
        else:
            continue
    return False
now = datetime.now()
current_time = now.strftime("%H:%M:%S")
print("Robot start time =", current_time)

async def deleteMessage(client: Client, message_ids: str):
    await sleep(5)
    await client.delete_messages(my_group, message_ids)


async def updateAdmins(client: Client) -> None:
    global group_admins
    results = await client(methods.groups.GetGroupAdminMembers(my_group))
    results = results.to_dict().get("in_chat_members")
    for result in results:
        GUID = result.get("member_guid")
        if not GUID in group_admins:
            group_admins.append(GUID)
        else:
            continue


async def get_user_name(client: Client, guid: str):
    user_info = await client.get_user_info(guid)
    return user_info.user.first_name


async def warn_user(client: Client, guid: str):
    num_warns = 0
    for warn in warning_users:
        if warn == guid:
            num_warns += 1
    name_user = await get_user_name(client, guid)
    if num_warns < warns_del:
        message_id = await client.send_message(
            my_group,
            f"👤 کاربر [{name_user}]({guid}) شما یک اخطار دریافت کردید\n\n- تعداد اخطار : {num_warns} از {warns_del} میباشد \n\n⚠️ مواظب باشید اخراج نشید",
        )
    elif num_warns >= warns_del:
        message_id = await client.send_message(
            my_group,
            f"👤 کاربر [{name_user}]({guid}) شما یک اخطار دریافت کردید\n\n- تعداد اخطار : {num_warns} از {warns_del} میباشد \n\n⚠️ شما حذف خواهید شد",
        )
        await client.ban_group_member(my_group, guid)
    await deleteMessage(client, [message_id.message_update.message_id])


async def get_guid_by_message_id(client: Client, mesage_id: str):
    messages = await client.get_messages_by_ID(my_group, [mesage_id])
    return messages.messages[0].author_object_guid


async def unwarnUser(guid: str):
    for guid_user in warning_users:
        if guid_user == guid:
            warning_users.remove(guid_user)


async def start_bot(client: Client):
    await updateAdmins(client)
    name_gap = await client.get_group_info(my_group)
    name_gap = name_gap.group.group_title
    await client.send_message(my_group, f" ربات مدیریت گروه[{name_gap} ]  با موفقیت فعال شد و برای دید دستورات راهنما وارد کنید🌸")

async def main():
    async with Client(session="bot") as client:
        await start_bot(client)

        @client.on(handlers.MessageUpdates(models.is_group()))
        async def updates(update: Message):
            if update.object_guid == my_group:
                if (
                    not update.author_guid in group_admins
                    and "forwarded_from" in update.to_dict().get("message").keys()
                ):
                    guid = await get_guid_by_message_id(client, update.message_id)
                    await update.delete_messages()
                    warning_users.append(guid)
                    await warn_user(
                        client,
                        guid,
                    )

                if update.raw_text != None:
                    if not update.author_guid in group_admins and getAds(
                        update.raw_text
                    ):
                        guid = await get_guid_by_message_id(client, update.message_id)
                        await update.delete_messages()
                        warning_users.append(guid)
                        await warn_user(
                            client,
                            guid,
                        )

                            
                    elif update.raw_text == "قوانین" or update.raw_text == "قوانین گروه":
                        await update.reply(
                            texts_chatz[random.randint(0, len(texts_chatz))]
                        )
                    elif update.raw_text == "اموزش ساخت ربات" or update.raw_text == "اموزش ساخت":
                        await update.reply(
                            texts_chato[random.randint(0, len(texts_chato))]
                        )

                    elif update.raw_text == "اهنگ" or update.raw_text == " اهنگ بگو":
                        await update.reply(
                             texts_chatq[random.randint(0, len(texts_chatq))]
                        )

                    elif update.raw_text == "فدات" or update.raw_text == "فداتشم":
                        await update.reply(
                            texts_chatr[random.randint(0, len(texts_chatr))]
                        )
                    elif update.raw_text == "فشار" or update.raw_text == "فشاربخور":
                        await update.reply(
                            texts_chatt[random.randint(0, len(texts_chatt))]
                        )

                    elif update.raw_text == "عزیزم" or update.raw_text == "عشقم":
                        await update.reply(
                            texts_chats[random.randint(0, len(texts_chats))]
                        )

                    elif update.raw_text == "هی" or update.raw_text == "کیر توش" or update.raw_text == "هییی":
                        await update.reply(
                            texts_chatn[random.randint(0, len(texts_chatn))]
                        )

                    elif update.raw_text == "نه" or update.raw_text == "نمیخوام":
                        await update.reply(
                            texts_chat22[random.randint(0, len(texts_chat22))]
                        )

                    elif update.raw_text == "شعر" or update.raw_text == "شعر بگو":
                        await update.reply(
                            texts_chat21[random.randint(0, len(texts_chat21))]
                        )
                    elif update.raw_text == "کیر خر" or update.raw_text == "کیر":
                        await update.reply(
                            texts_chat19[random.randint(0, len(texts_chat19))]
                        )

                    elif update.raw_text == "سایت پورن":
                        await update.reply(
                            texts_chat18[random.randint(0, len(texts_chat18))]
                        )

                    elif update.raw_text == "رل پی" or update.raw_text == "رل میزنی":
                        await update.reply(
                            texts_chat17[random.randint(0, len(texts_chat17))]
                        )

                    elif update.raw_text == "چیستان" or update.raw_text == "چیستان بگو":
                        await update.reply(
                            texts_chat16[random.randint(0, len(texts_chat16))]
                        )
                    elif update.raw_text == "جون" or update.raw_text == "ای جان":
                        await update.reply(
                            texts_chat15[random.randint(0, len(texts_chat15))]
                        )

                    elif update.raw_text == "ممد"or update.raw_text == "ممد داداشم":
                        await update.reply(
                            texts_chat14[random.randint(0, len(texts_chat14))]
                        )
                    elif update.raw_text == "دوست دارم"or update.raw_text == "عاشقتم" or update.raw_text == "دوست دارم عشقم":
                        await update.reply(
                            texts_chat13[random.randint(0, len(texts_chat13))]
                        )
                    elif update.raw_text == "بپرس"or update.raw_text == "بپرسید":
                        await update.reply(
                            texts_chat12[random.randint(0, len(texts_chat12))]
                        )

                    elif update.raw_text == "بیوگرافی"or update.raw_text == "بیو":
                        await update.reply(
                            texts_chat11[random.randint(0, len(texts_chat11))]
                        )

                    elif update.raw_text == "من اومدم"or update.raw_text == "عشقتون اومد":
                        await update.reply(
                            texts_chat10[random.randint(0, len(texts_chat10))]
                        )
                    elif update.raw_text == "من برم"or update.raw_text == "خدافظ" or update.raw_text == "بای":
                        await update.reply(
                            texts_chat9[random.randint(0, len(texts_chat9))]
                        )

                    elif update.raw_text == "😂"or update.raw_text == "😂😂😂" or update.raw_text == "😂😂":
                        await update.reply(
                            texts_chat8[random.randint(0, len(texts_chat8))]
                        )

                    elif update.raw_text == "چه خبر" or update.raw_text == "نخبر":
                        await update.reply(
                            texts_chat7[random.randint(0, len(texts_chat7))]
                        )
                    elif update.raw_text == "خوبم" or update.raw_text == "فداتشم":
                        await update.reply(
                            texts_chat6[random.randint(0, len(texts_chat6))]
                        )

                    elif update.raw_text == "دانستنی" or update.raw_text == "دانستنی":
                        await update.reply(
                            texts_chat5[random.randint(0, len(texts_chat5))]
                        )

                    elif update.raw_text == "تایگر" or update.raw_text == "تایگر جان":
                        await update.reply(
                            texts_chat4[random.randint(0, len(texts_chat4))]
                        )

                    elif update.raw_text == "کص ننت" or update.raw_text == "کص عمت" or update.raw_text == "کص خارت":
                        await update.reply(
                            texts_chat3[random.randint(0, len(texts_chat3))]
                        )
                    elif update.raw_text == "خوبم تو جطوری" or update.raw_text == "عالم تو خوبی":
                          await update.reply(
                            texts_chat2[random.randint(0, len(texts_chat2))]
                        )

                    elif update.raw_text == "جوک" or update.raw_text == "جوک بگو":
                        await update.reply(
                            texts_jok[random.randint(0, len(texts_jok))]
                        )

                    elif update.raw_text == "خوبی" or update.raw_text == "چطوری" or update.raw_text == "خبی" or update.raw_text == "خوبی تایگر":
                        await update.reply(
                            texts_chat1[random.randint(0, len(texts_chat1))]
                        )

                    elif update.raw_text == "سلام" or update.raw_text == "صلوم" or update.raw_text == "سلم":
                        await update.reply(
                            texts_chat[random.randint(0, len(texts_chat))]
                        )

                    elif update.raw_text == "ربات" or update.raw_text == "bot":
                        await update.reply(
                            texts_bot[random.randint(0, len(texts_bot))]
                        )

                    elif getInsults(update.raw_text):
                        message_id = await update.reply("دوست عزیز فحش شما پاک شد")
                        await update.delete_messages()
                        await deleteMessage(
                            client, [message_id.message_update.message_id]
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "!open"
                    ):
                        result = await client(
                            methods.groups.SetGroupDefaultAccess(
                                my_group, ["SendMessages"]
                            )
                        )
                        message_id = await update.reply("گروه باز شد.")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "!close"
                    ):
                        result = await client(
                            methods.groups.SetGroupDefaultAccess(my_group, [])
                        )
                        message_id = await update.reply("گروه بسته شد.")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "!warn"
                        and update.reply_message_id != None
                    ):
                        guid = await get_guid_by_message_id(
                            client, update.reply_message_id
                        )
                        if not guid in group_admins:
                            warning_users.append(guid)
                            await warn_user(
                                client,
                                guid,
                            )
                            await deleteMessage(client, [update.message_id])
                        else:
                            message_id = await reply("کاربر ادمین میباشد")
                            await deleteMessage(
                                client,
                                [
                                    update.message_id,
                                    message_id.message_update.message_id,
                                ],
                            )

                    elif update.author_guid in group_admins and update.text.startswith(
                        "!unwarn @"
                    ):
                        username = update.text.split("@")[-1]
                        user_info = await client.get_object_by_username(username)
                        user_info = user_info.user.user_guid
                        if not user_info in group_admins:
                            if user_info in warning_users:
                                await unwarnUser(user_info)
                                name_user = await get_user_name(client, user_info)
                                message_id = await client.send_message(
                                    my_group,
                                    f"کاربر [{name_user}]({user_info}) اخطار های شما پاک شدند",
                                )
                            else:
                                message_id = await update.reply(
                                    "کاربر اخطاری ندارد که پاک شود"
                                )
                        else:
                            message_id = await update.reply(
                                "کاربر در گروه ادمین میباشد"
                            )
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "!look-gif"
                    ):
                        global no_gifs
                        no_gifs = True
                        message_id = await update.reply("گیف قفل شد.")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "!unlook-gif"
                    ):
                        no_gifs = False
                        message_id = await update.reply("قفل گیف رفع شد.")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text.startswith("!silent")
                    ):
                        if update.reply_message_id != None:
                            try:
                                result = await client(
                                    methods.messages.GetMessagesByID(
                                        my_group, [update.reply_message_id]
                                    )
                                )
                                result = result.to_dict().get("messages")[0]
                                if not result.get("author_object_guid") in group_admins:
                                    global silence_list
                                    silence_list.append(
                                        result.get("author_object_guid")
                                    )
                                    message_id = await update.reply(
                                        "کاربر مورد نظر در حالت سکوت قرار گرفت."
                                    )
                                else:
                                    message_id = await update.reply(
                                        "کاربر مورد نظر در گروه ادمین است."
                                    )
                                await deleteMessage(
                                    client,
                                    [
                                        update.message_id,
                                        message_id.message_update.message_id,
                                    ],
                                )
                            except IndexError:
                                message_id = await update.reply(
                                    "ظاهرا پیامی که روی آن ریپلای کرده اید پاک شده است."
                                )
                                await deleteMessage(
                                    client,
                                    [
                                        update.message_id,
                                        message_id.message_update.message_id,
                                    ],
                                )
                        elif update.text.startswith("!silent @"):
                            username = update.text.split("@")[-1]
                            if username != "":
                                result = await client(
                                    methods.extras.GetObjectByUsername(username.lower())
                                )
                                result = result.to_dict()
                                if result.get("exist"):
                                    if result.get("type") == "User":
                                        user_guid = result.get("user").get("user_guid")
                                        if not user_guid in group_admins:
                                            silence_list.append(user_guid)
                                            message_id = await update.reply(
                                                "کاربر مورد نظر در حالت سکوت قرار گرفت."
                                            )
                                        else:
                                            message_id = await update.reply(
                                                "کاربر مورد نظر در گروه ادمین است."
                                            )
                                    else:
                                        message_id = await update.reply(
                                            "کاربر مورد نظر کاربر عادی نیست."
                                        )
                                else:
                                    message_id = await update.reply(
                                        "آیدی مورد نظر اشتباه است."
                                    )
                            else:
                                message_id = await update.reply(
                                    "آیدی مورد نظر اشتباه است."
                                )
                            await deleteMessage(
                                client,
                                [
                                    update.message_id,
                                    message_id.message_update.message_id,
                                ],
                            )
                        else:
                            message_id = await update.reply(
                                "روی یک کاربر ریپلای بزنید."
                            )
                            await deleteMessage(
                                client,
                                [
                                    update.message_id,
                                    message_id.message_update.message_id,
                                ],
                            )

                    elif (
                        update.author_guid in group_admins
                        and update.raw_text.startswith("!clean-list-silent")
                    ):
                        if silence_list == []:
                            message_id = await update.reply("لیست سکوت خالی است.")
                        else:
                            silence_list = []
                            message_id = await update.reply("لیست سکوت خالی شد.")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif update.raw_text == "!link":
                        result = await client(methods.groups.GetGroupLink(my_group))
                        result = result.to_dict().get("join_link")
                        message_id = await update.reply(f"لینک گروه:\n{result}")
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

                    elif (
                        update.author_guid in group_admins
                        and update.text == "!update-admins"
                    ):
                        message_ids = update.message_id
                        reply = await update.reply(
                            "در حال به روزرسانی لیست ادمین ها..."
                        )
                        await updateAdmins(client)
                        await sleep(2)
                        message_id = await reply.edit(
                            "به روزرسانی لیست ادمین ها انجام شد."
                        )
                        await deleteMessage(
                            client, [message_ids, message_id.message_update.message_id]
                       )   
                    elif (
                        update.author_guid in group_admins
                        and update.raw_text == "راهنما"
                    ):
                        text = f"""🖇 راهنمای تایگر
    [⚙اهنگ]
    [⚙شعر]                    
   [⚙ قوانین ]
  [⚙ چیستان]
  [⚙ بیوگرافی]
   [⚙ جوک]
  [⚙ دانستنی]
___________________

⚙ `!ban ` 
- حذف شخص از گپ [حتما رپلای کنید]

⚙ `!ban @id `
- حذف شخص از گپ

⚙ `!warn ` 
- اخطار به شخص [حتما رپلای کنید]

⚙ `!unwarn @id `
- حذف اخطار شخص

⚙ `!silent ` 
- حذف پیام های شخص در گپ

⚙ `!silent @id `
- حذف پیام های شخص در گپ

⚙ `!clean-list-silent`
- پاکسازی لیست سکوت

⚙ `!update-admins `
- اپدیت مدیران

⚙ `!look-gif `
- حذف گیف در گروه

⚙ `!unlook-gif `
- پاک نشدن گیف در گروه توسط ربات

⚙ `!open `
- بازکردن گروه

⚙ `!close `
- قفل گروه

───> channel : {channe_id} <───

🤖 قابلیت های خودکار

⚙ ضدلینک
- حذف لینک های ارسالی به گروه

⚙ حذف فش
- حذف فش های ارسالی به گروه

                        """
                        await update.reply(text)

                    elif update.author_guid in group_admins and update.text.startswith(
                        "!ban"
                    ):
                        if update.reply_message_id != None:
                            try:
                                result = await client(
                                    methods.messages.GetMessagesByID(
                                        my_group, [update.reply_message_id]
                                    )
                                )
                                result = result.to_dict().get("messages")[0]
                                if not result.get("author_object_guid") in group_admins:
                                    result = await client(
                                        methods.groups.BanGroupMember(
                                            my_group,
                                            result.get("author_object_guid"),
                                        )
                                    )
                                    message_id = await update.reply(
                                        "کاربر مورد نظر از گروه حذف شد."
                                    )
                                else:
                                    message_id = await update.reply(
                                        "کاربر مورد نظر در گروه ادمین است."
                                    )
                                    await deleteMessage(
                                        client,
                                        [
                                            update.message_id,
                                            message_id.message_update.message_id,
                                        ],
                                    )
                            except IndexError:
                                message_id = await update.reply(
                                    "ظاهرا پیامی که روی آن ریپلای کرده اید پاک شده است."
                                )  
                                await deleteMessage(
                                    client,
                                    [
                                        update.message_id,
                                        message_id.message_update.message_id,
                                    ],
                                )
                        elif update.text.startswith("!ban @"):
                            username = update.text.split("@")[-1]
                            if username != "":
                                result = await client(
                                    methods.extras.GetObjectByUsername(username.lower())
                                )
                                result = result.to_dict()
                                if result.get("exist"):
                                    if result.get("type") == "User":
                                        user_guid = result.get("user").get("user_guid")
                                        if not user_guid in group_admins:
                                            result = await client(
                                                methods.groups.BanGroupMember(
                                                    my_group, user_guid
                                                )
                                            )
                                            message_id = await update.reply(
                                                "کاربر مورد نظر از گروه حذف شد."
                                            )
                                        else:
                                            message_id = await update.reply(
                                                "کاربر مورد نظر در گروه ادمین است."
                                            )
                                    else:
                                        message_id = await update.reply(
                                            "کاربر مورد نظر کاربر عادی نیست."
                                        )
                                else:
                                    message_id = await update.reply(
                                        "آیدی مورد نظر اشتباه است."
                                    )
                            else:
                                message_id = await update.reply(
                                    "آیدی مورد نظر اشتباه است."
                                )
                        else:
                            message_id = await update.reply(
                                "روی یک کاربر ریپلای بزنید."
                            ) 
                        await deleteMessage(
                            client,
                            [update.message_id, message_id.message_update.message_id],
                        )

        @client.on(handlers.MessageUpdates(models.is_group()))
        async def updates(update):
            if update.object_guid == my_group:
                if update.author_guid in silence_list:
                    await update.delete_messages()
                else:
                    if no_gifs:
                        if not update.author_guid in group_admins:
                            result = await client(
                                methods.messages.GetMessagesByID(
                                    my_group, [update.message_id]
                                )
                            )
                            result = result.to_dict().get("messages")[0]
                            if (
                                result.get("type") == "FileInline"
                                and result.get("file_inline").get("type") == "Gif"
                            ):
                                await update.delete_messages()
        await client.run_until_disconnected()
run(main())
